// 5. Написать программу вычисления значения функции y=f(a)

void function (double x){
Console.WriteLine($"Cos от {x} = {Math.Cos(x)}");
}
function (3);