//2. Даны два числа. Показать большее и меньшее число

void comparasion (int numberA, int numberB){
    if (numberA > numberB) {Console.WriteLine($"Max {numberA} Min {numberB}");}
    else {Console.WriteLine($"Max {numberB} Min {numberA}");}
}
comparasion (123, 56);